Wojciech Wiszniewski

W tym ćwiczeniu miałem wygenerować dataframe z kolumnami o nazwach name, surname, age i sex. Do tego celu wykorzystałem moduł pandas. W pierwszej kolejności stworzłem listę z danymi o pięciu różnych osobach, następnie za pomocą modułu pandas wykorzystałem ją do utworzenia dataframe. Na konies sprawdziłem informacje o danych, opis danych i pierwsze trzy rekordy utworzonej dataframe.

1. importuję moduł pandas

In [27]:
import pandas as pd

2. tworzę listę z danymi o osobach

In [28]:
osoby = [('Ferdynand','Kiepski','58','Male'),
        ('Lech', 'Dyblik', '66', 'Male'),
        ('Marian', 'Paździoch', '78', 'Male'),
        ('Mariola', 'Kiepska', '20', 'Female'),
        ('Arnold', 'Boczek', '58', 'Male')]

3. tworzę dataframe ze zdefiniowanymi nazwami kolumn, wypełnioną danymi z listy 'osoby'

In [29]:
df = pd.DataFrame(osoby, columns = ["name", "surname", "age", "sex"])

4. wyświetlam dataframe

In [30]:
df

        name    surname age     sex
0  Ferdynand    Kiepski  58    Male
1       Lech     Dyblik  66    Male
2     Marian  Paździoch  78    Male
3    Mariola    Kiepska  20  Female
4     Arnold     Boczek  58    Male

5. wyświetlam informacje o danych

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      object
 3   sex      5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes

6. wyświetlam opis danych

In [32]:
df.describe()

             name  surname age   sex
count           5        5   5     5
unique          5        5   4     2
top     Ferdynand  Kiepski  58  Male
freq            1        1   2     4

7. wyświetlam trzy pierwsze rekordy

In [33]:
df.head(3)

        name    surname age   sex
0  Ferdynand    Kiepski  58  Male
1       Lech     Dyblik  66  Male
2     Marian  Paździoch  78  Male